app/Filament/Resources/Jobs/Schemas/JobForm.php


                            return $optionRecord->id;
                        })
                        // Configure edit action - https://filamentphp.com/docs/4.x/forms/select#editing-the-selected-option-in-a-modal
                        ->editOptionModalHeading('Edit')
                        ->editOptionForm(fn (Schema $schema) => EmployerForm::configure($schema))
                        ->fillEditOptionActionFormUsing(function (string $state) {
                            if (!$state) {
                                return [];
                            }

                            $optionRecord = Employer::find($state);

                            return EmployerResource::mutateTranslatableData($optionRecord, $optionRecord->attributesToArray());
                        })
                        ->updateOptionUsing(function (array $data, string $state) {
                            $optionRecord = Employer::find($state);

                            $optionRecord->update($data);

                            return $optionRecord->id;
                        })
                        ->preload(),
---
select * from `employers`