app/Filament/Employer/Resources/EmployerJobs/Schemas/EmployerJobForm.php

select * from `Employers` where `Employers`.`user_id` = 2 and `Employers`.`user_id` is not null limit 1
---
    public static function configure(Schema $schema): Schema
    {
        return $schema
            ->components([
                TextInput::make('title')
                    ->required()
                    ->maxLength(255),
                TextInput::make('url')
                    ->required()
                    ->maxLength(255),
                TextInput::make('salary')
                    ->prefix('$')
                    ->required()
                    ->maxLength(255),
                TextInput::make('location')
                    ->required()
                    ->maxLength(255),
                Select::make('type')
                    ->options([
                        'full_time' => 'Full Time',
                        'part_time' => 'Part Time',
                        'contract' => 'Contract',
                        'internship' => 'Internship',
                    ])
                    ->label('Job Type')
                    ->required(),
                Select::make('Employer_id')
                    ->relationship(
                        name: 'Employer', // This must match the relationship method name on your current model
                        titleAttribute: 'name', // The column name you want to display in the dropdown
                        modifyQueryUsing: fn (Builder $query) => $query->where('user_id', auth::id())
                    )
                    ->searchable()
                    ->preload()
                    ->default(Auth::user()->Employer->id),