app/Filament/Widgets/UserChart.php

select count(*) as aggregate from `users` where `status` = 'Admin'
select count(*) as aggregate from `users` where `status` = 'JobSeeker'
select count(*) as aggregate from `users` where `status` = 'admin'
---
    protected function getData(): array
    {
        $AdminCount = User::where('status', 'Admin')->count();
        $jobSeekerCount = User::where('status', 'JobSeeker')->count();
        $EmployerCount = User::where('status', 'Employer')->count();