app/Http/Controllers/JobController.php

select "tags".*, "job_tag"."job_id" as "pivot_job_id", "job_tag"."tag_id" as "pivot_tag_id" from "tags" inner join "job_tag" on "tags"."id" = "job_tag"."tag_id" where "job_tag"."job_id" in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22)
select * from "employers" where "employers"."id" in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 22)
select * from `employers` where `employers`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20)
select `tags`.*, `job_tag`.`job_id` as `pivot_job_id`, `job_tag`.`tag_id` as `pivot_tag_id` from `tags` inner join `job_tag` on `tags`.`id` = `job_tag`.`tag_id` where `job_tag`.`job_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20)
select * from `tags`
---
    public function index()
    {
        /*
        $jobs = Job::latest()->with(['Employer', 'Tags'])->get()->groupBy('featured');

        return view('jobs.index', [
            'Tags' => Tag::all(),
            'featuredJobs' => Job::where('featured', 1)
                ->latest()
                ->with(['Employer', 'Tags'])
                ->get(),
            'jobs' => Job::where('featured', 0)
                ->latest()
                ->with(['Employer', 'Tags'])
                ->get(),

        ]);
        */
        $jobs = Job::latest()
            ->with(['Employer', 'Tags'])
            ->get()
            ->groupBy('featured');

        return view('jobs.index', [
            'featuredJobs' => $jobs->get(1, collect()),
            'jobs' => $jobs->get(0, collect()),
            'Tags' => Tag::all(),