app/Http/Controllers/SiteController.php

select count(*) as aggregate from `Employers`
select count(*) as aggregate from `users` where `type` = 'JobSeeker'
---
    public function about()
    {
        // statistics for the platform
        $jobCount = Job::count();
        $employerCount = Employer::count();
        $seekerCount = User::where('type', 'JobSeeker')->count();